<script setup lang="ts">

</script>

<template>
  <div class="flex flex-col gap-[60px] laptop:gap-12 tablet:gap-10 mobile:gap-8">
    <div class="container">
      <div class="flex flex-col gap-10 laptop:gap-9 tablet:gap-8 mobile:gap-7">
        <div class="flex flex-col gap-8 laptop:gap-7 tablet:gap-6">
          <h2 class="text-xl4 font-medium laptop:text-laptopXl4 tablet:text-tabletXl4 mobile:text-mobileXl4">
            Текстовая страница
          </h2>
          <div class="flex flex-col gap-5 text-l laptop:text-laptopL tablet:gap-4">
            <p>Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика») представляет собой правила использования /указать владельца сайта/ (далее – «мы» и/или «Администрация») данных интернет-пользователей (далее «вы» и/или «Пользователь»), собираемых с использованием сайта / указать URL сайта/ (далее – «сайт»).</p>
            <p>1. Обрабатываемые данные</p>
            <p>1.1. Мы не осуществляем сбор ваших персональных данных с использованием сайта.</p>
            <p>1.2. Все данные, собираемые на сайте, предоставляются и принимаются в обезличенной форме (далее – «Обезличенные данные»).</p>
            <p>1.3. Обезличенные данные включают следующие сведения, которые не позволяют вас идентифицировать.</p>
            <p>1.3.1. Информацию, которую вы предоставляете о себе самостоятельно с использованием онлайн-форм и программных модулей сайта, включая имя и номер телефона и/или адрес электронной почты.1.3.2. Данные, которые передаются в обезличенном виде в автоматическом режиме в зависимости от настроек используемого вами программного обеспечения.</p>
            <p>1.4. Администрация вправе устанавливать требования к составу Обезличенных данных Пользователя, которые собираются использованием сайта.</p>
            <p>1.5. Если определённая информация не помечена как обязательная, её предоставление или раскрытие осуществляется Пользователем на своё усмотрение. Одновременно вы даёте информированное согласие на доступ неограниченного круга лиц к таким данным. Указанные данные становится общедоступными с момента предоставления и/или раскрытия в иной форме.</p>
            <p>1.6. Администрация не осуществляет проверку достоверности предоставляемых данных и наличия у Пользователя необходимого согласия на их обработку в соответствии с настоящей Политикой, полагая, что Пользователь действует добросовестно, осмотрительно и прилагает все необходимые усилия к поддержанию такой информации в актуальном состоянии и получению всех необходимых согласий на её использование.</p>
            <p>1.7. Вы осознаете и принимаете возможность использования на сайте программного обеспечения третьих лиц, в результате чего такие лица могут получать и передавать указанные в п.1.3 данные в обезличенном виде.Пример! К указанному программному обеспечению третьих лиц относятся системы сбора статистики посещений Google Analytics и Яндекс.Метрика.</p>
          </div>
        </div>
        <div class="flex flex-col gap-6 tablet:gap-5">
          <h3 class="text-xl2 font-medium laptop:text-laptopXl2 mobile:text-mobileXl2">
            Название блока
          </h3>
          <div class="flex flex-col gap-5 text-l laptop:text-laptopL tablet:gap-4">
            <p>Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика») представляет собой правила использования /указать владельца сайта/ (далее – «мы» и/или «Администрация») данных интернет-пользователей (далее «вы» и/или «Пользователь»), собираемых с использованием сайта / указать URL сайта/ (далее – «сайт»).</p>
            <p>1. Обрабатываемые данные</p>
            <p>1.1. Мы не осуществляем сбор ваших персональных данных с использованием сайта.</p>
          </div>
        </div>
      </div>
    </div>
    <div class="flex items-start gap-5 tablet:gap-4 pl-[310px] laptop:pl-[100px] tablet:px-[60px] tablet:flex-col mobile:px-5">
      <div class="flex flex-col gap-5 text-l laptop:text-laptopL tablet:gap-4">
        <p>Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика») представляет собой правила использования /указать владельца сайта/ (далее – «мы» и/или «Администрация») данных интернет-пользователей (далее «вы» и/или «Пользователь»), собираемых с использованием сайта / указать URL сайта/ (далее – «сайт»).</p>
        <p>1. Обрабатываемые данные</p>
        <p>1.1. Мы не осуществляем сбор ваших персональных данных с использованием сайта.</p>
        <p>1.2. Все данные, собираемые на сайте, предоставляются и принимаются в обезличенной форме (далее – «Обезличенные данные»).</p>
        <p>1.3. Обезличенные данные включают следующие сведения, которые не позволяют вас идентифицировать.</p>
      </div>
      <img
        src="/images/policy.png"
        alt="Изображение"
        class="rounded-l-s laptop:w-[55%] tablet:rounded-s tablet:w-full"
      >
    </div>
    <div class="container">
      <div class="flex flex-col gap-5 text-l laptop:text-laptopL tablet:gap-4">
        <p>Настоящий документ «Политика конфиденциальности» (далее по тексту – «Политика») представляет собой правила использования /указать владельца сайта/ (далее – «мы» и/или «Администрация») данных интернет-пользователей (далее «вы» и/или «Пользователь»), собираемых с использованием сайта / указать URL сайта/ (далее – «сайт»).</p>
        <p>1. Обрабатываемые данные</p>
        <p>1.1. Мы не осуществляем сбор ваших персональных данных с использованием сайта.</p>
      </div>
    </div>
  </div>
</template>
